#include <iostream>
#include <cmath> // для використання функції pow
#include <Windows.h>

using namespace std;

int main() {
    SetConsoleCP(1251); // встановлення кодування Windows-1251 в  потік введення
    SetConsoleOutputCP(1251); // встановлення кодування Windows-1251 в  потік виведення
    int start = 5; // початок діапазону
    int end = 50; // кінець діапазону
    long long sum = 0; // змінна для збереження суми кубів

    // Обчислення суми кубів всіх натуральних чисел від 5 до 50
    for (int i = start; i <= end; ++i) {
        sum += pow(i, 3); // додавання кубу числа i до загальної суми
    }

    // Виведення результату
    cout << "Сума кубів всіх натуральних чисел від " << start << " до " << end << " дорівнює " << sum << endl;

    // Виведення інформації про програму та автора
    cout << "Проект: Обчислення суми кубів всіх натуральних чисел від 5 до 50" << endl;
    cout << "Автор: Туна Деніз Мехметович" << endl;

    return 0;
}
